app/Http/Livewire/Admin/AdminCategoryComponent.php

select * from `categories` limit 8 offset 0
select count(*) as aggregate from `categories`
---
    public function render()
    {
        $categories = Categories::paginate(8);