app/Http/Livewire/FooterComponent.php

select * from `setting` where `setting`.`id` = 1 limit 1
---
    public function render()
    {
        $setting=setting::find(1);



        return view('livewire.footer-component')->with('setting',$setting);