app/Http/Livewire/HeaderComponent.php

    public function render()
    {
        $setting=setting::find(1);
        return view('livewire.header-component')->with('setting',$setting);
---
select * from `setting` where `setting`.`id` = 1 limit 1