app/Http/Livewire/HeaderSearchComponent.php

select * from `categories`
---
    public function render()
    {
        $categories = Categories::all();