app/Http/Livewire/HomeComponent.php

select * from `categories`
---
    public function render()
    {

        $allproducts=new products();
        $banner=banners::where('status', 1)->get();
        $data = $allproducts::orderBy('id','ASC')->get();
        $specialtdata = $allproducts::where('condition','special')->orderBy('id','ASC')->limit(6)->get();

        $maincategories=Categories::all();

        $totalcategories=Categories::all();