app/Http/Livewire/ShopComponent.php

    public function render()
    {
        if($this->sorting=='date')
        {
            $products = products::whereBetween('price',[$this->min_price,$this->max_price])->orderBy('created_at','DESC')->paginate($this->pagesize);


        }
        else if($this->sorting=="price")
        {
            $products = products::whereBetween('price',[$this->min_price,$this->max_price])->orderBy('price','ASC')->paginate($this->pagesize);
        }
        else if($this->sorting=="price-desc")
        {
            $products = products::whereBetween('price',[$this->min_price,$this->max_price])->orderBy('price','DESC')->paginate($this->pagesize);
        }
        else
        {
            $products = products::whereBetween('price',[$this->min_price,$this->max_price])->paginate($this->pagesize);
        }


        $categories = Categories::get();
---
select * from `categories`